#include <iostream>
#include <cstdlib>
#include <string>
#include <ctime>
#include <iomanip>

using namespace std;

class chinese {
	
private:	
	string food[8] = {"탕수육","깐풍기","칠리새우","짬뽕","사천탕수육","짜장면","유린기","북경식탕수육"};
	string restaurant[3] = {"대가호","샤오시안","홍콩반점0410"};
	string Phone[3] = { "051-512-9044","051-624-2744","051-516-0410" };
	string Address[3] = { "부산광역시 금정구 장전2동 장전로 53","부산광역시 금정구 장전3동 부산대학교 50번길 16","부산광역시 금정구 장전2동 부산대학로 64번길 34" };

public:

	void ShowRandom() {		
	
		int i = rand() % 8; //0부터 (M-1)까지의 수가 생성됨
		cout <<"선택된 메뉴는"<<" "+food[i]+ " " << "입니다."<<endl;
	}

	void ShowAddNum() {		
		for (int i = 0; i < 3; i++) {
            cout << left << setw(15)<<restaurant[i] << setw(50) << Address[i] << setw(10) << Phone[i] << endl;
		}
	}
};

class japanese {
private:
	string food[8] = { "초밥","돈부리","참치회","소바","모코노미야끼","라멘","장어덮밥","우동" };
	string restaurant[3] = { "나오리쇼쿠","모시모시","델라고" };
	string Phone[3] = { "070-7772-4128","051-515-6245","051-515-1504" };
	string Address[3] = { "부산광역시 금정구 장전2동 409-14","부산광역시 금정구 장전2동 금강로 271-5","부산광역시 금정구 장전2동 금강로 253-1"};
public:

    void ShowRandom() {
        int i = rand() % 8; //0부터 (M-1)까지의 수가 생성됨
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }

    void ShowAddNum() {
        for (int i = 0; i < 3; i++) {
            
            cout << left << setw(15) << restaurant[i] << setw(50) << Address[i] << setw(10) << Phone[i] << endl;
        }
    }
};


class chicken {
private:
    string food[8] = { "BBQ","BHC","네네치킨","굽네치킨","교촌치킨","썬더치킨","푸라닭","처갓집" };
    string foodname[8][3] = {
        {"부산대학교점","부산장전점","부산대북문점"},
        {"부산대점","금정부곡점","온천중앙점"},
        {"부산대점","부곡1점","온천점"},
        {"부산장전점","부산부곡점","부산부곡2호점"},
        {"부산대점","장전1호점","부곡2호점"},
        {"부산대점","부곡점","온천1호점"},
        {"부산장전점","부산구서점","부산명륜점"},
        {"장전점","부곡점","금정산SK점"},
    };
    string foodnum[8][3] = {
        {"0504-457-9317","051-582-8292","051-582-9290"},
        {"0504-109-9329","0504-3142-1057","0504-3142-2057"},
        {"051-514-9985","0504-359-8362","051-552-4482"},
        {"0504-359-8540","0504-3143-8325","0504-3143-8351"},
        {"051-582-8588","051-514-8200","0504-109-1701"},
        {"051-515-8592","051-583-8592","051-517-9279"},
        {"051-583-9206","051-513-9206","051-553-9206"},
        {"051-583-6262","0504-359-7490","051-514-0123"},
    };
    string foodadd[8][3] = {
        {"금정구 금정로 92","금정구 금강로 225","금정구 수림로71번길 56"},
        {"금정구 금강로 230","금정구 중앙대로1685번길 26","동래구 온천장로125번길 13-3"},
        {"금정구 금강로 327","금정구 오륜대로 34","동래구 차밭골로 271"},
        {"금정구 장전온천천로73번길 6","금정구 중앙대로1706번길 15","금정구 서동로 36"},
        {"금정구 금강로 270","금정구 금강로335번길 48","금정구 부곡로 92"},
        {"금정구 부산대학로38번길 23","금정구 동부곡로 4","금정구 온천장로125번길 26"},
        {"금정구 금정로 9-1","금정구 금강로 467","동래구 시실로 42-1"},
        {"금정구 금정로149번길 8","금정구 동현로 23","금정구 식물원로 82"},
    };
public:
    int i=0;

    void ShowRandom() {
        i = rand() %8; //0부터 (M-1)까지의 수가 생성됨
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }
    void ShowName() {
        for (int q = 0; q < 3; q++) {
            cout << left << setw(15) << foodname[i][q] << setw(50) << foodadd[i][q] << setw(10) << foodnum[i][q] << endl;
        }

    }

};

class korean {
private:
    string food[8] = { "밀면","돼지국밥","찜닭","칼국수","김치찌개","곱창","불고기백반","덮밥" };
    string foodname[8][3] = {
        {"부산밀면","전통쑥밀면","유림부대밀면"},
        {"진국명가","진주 비봉식당","터줏집 돼지국밥"},
        {"내가찜한닭","봉추찜닭","요달의 찜닭"},
        {"황금칼국수","맥가이버 손칼국수","춘하추동"},
        {"대독장","정성식당","킹치찌개찜"},
        {"곱창이야기","칠성돌곱창","군자대한곱창"},
        {"대길고추불고기","부광식당","옹헤야"},
        {"밥에큐","오공복이","홍대개미"},
    };
    string foodnum[8][3] = {
        {"051-582-1110","051-515-9337","051-512-6692"},
        {"051-512-8880","051-518-1146","051-581-1578"},
        {"051-581-1238","051-515-6981","051-518-3909"},
        {"051-515-3005","051-514-3422","051-517-7003"},
        {"051-516-9655","051-581-3005","051-512-9938"},
        {"051-518-7740","051-515-1061","051-518-9295"},
        {"051-516-4707","051-514-9102","051-518-0117"},
        {"051-582-1566","051-583-0407","051-523-0920"},
    };
    string foodadd[8][3] = {
        {"금정구 부산대학로63번길 50","금정구 부산대학로63번길 21-5","금정구 부산대학로 38"},
        {"금정구 금강로 271","금정구 부산대학로49번길 13","금정구 부산대학로49번길 13"},
        {"금정구 부산대학로 57","금정구 장전온천천로 65","금정구 금강로 349-1"},
        {"금정구 장전온천천로83번길 24","금정구 부산대학로 34-2","금정구 금강로 250"},
        {"금정구 부산대학로63번길 39","금정구 금강로 249","금정구 부산대학로49번길 8"},
        {"금정구 부산대학로50번길 12","금정구 부산대학로49번길 49","금정구 부산대학로50번길 22"},
        {"금정구 장전로 47","금정구 금강로321번길 72","금정구 금정로60번길 32"},
        {"금정구 금강로 264","금정구 부산대학로49번길 33","금정구 금정로60번길 37"},
    };
public:
    int i=0;

    void ShowRandom() {
        i = rand() % 8; //0부터 (M-1)까지의 수가 생성됨
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }
    void ShowName() {
        for (int q = 0; q < 3; q++) {
            cout << left << setw(15) << foodname[i][q] << setw(50) << foodadd[i][q] << setw(10) << foodnum[i][q] << endl;
        }
    }

};

class meat {
private:
    string food[8] = { "삼겹살","목살","갈매기살","항정살","가브리살","갈비","등심","안심" };
    string name[8][3] = {
        { "신육간","고기랑한방울","돼지집딸" },
        { "신육간","고기랑한방울","돼지집딸" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        { "지대루 참숯왕소금구이","선진축산","칼집삼겹" },
        {"통큰집","맵당","홍보석 숯불구이"},
        {"황소야","시어링앤스터프","조선화로집"},
        {"황소야","시어링앤스터프","조선화로집"}
    };
    string num[8][3] = {
        {"051-515-6668","051-516-8474","051-512-5550"},
        {"051-515-6668","051-516-8474","051-512-5550"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-583-3005","0507-1383-3637","051-513-9392"},
        {"051-512-2331","051-515-3373","051-581-0950"},
        {"051-515-2152","0507-1320-6227","051-583-9194"},
        {"051-515-2152","0507-1320-6227","051-583-9194"}
    };
    string address[8][3] = {
        {"금정구 금정로91번길 20","금정구 금강로 274-3","금정구 부산대학로50번길 26" },
        {"금정구 금정로91번길 20","금정구 금강로 274-3","금정구 부산대학로50번길 26" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 식물원로 28","금정구 금강로 278 2층","금정구 금정로91번길 3" },
        {"금정구 금정로60번길 7-3","금정구 금강로 269","금정구 금강로 256-7"},
        {"금정구 부산대학로49번길 32","금정구 부산대학로49번길 52","금정구 식물원로 25" },
        {"금정구 부산대학로49번길 32","금정구 부산대학로49번길 52","금정구 식물원로 25"}
    };
public:
    int i=0;

    void ShowRandom() {
        i = rand() % 8;
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }

    void ShowName() {
        for (int q = 0; q < 3; q++) {
            cout << left << setw(15) << name[i][q] << setw(50) << address[i][q] << setw(10) << num[i][q] << endl;
        }
    }
};

class desert {
private:
    string food[6] = { "떡볶이&순대","빙수","보쌈","푸딩","빵","케이크" };
    string name[6][3] = {
        {"죠스떡볶이","엽기떡볶이","신전떡볶이"},
        {"서빙고", "설빙","카카오두"},
        {"싸움의 고수","명가왕족","명주네보쌈"},
        {"all about banana","sweater bakeshop","카페호밀"},
        {"sweater bakeshop","이흥용과자점","파나카B"},
        {"sweater bakeshop","이흥용과자점","파나카B"}
    };
    string num[6][3] = {
        {"051-581-1077","051-4109-8635","051-517-3451"},
        {"070-4195-5345","051-583-0117","0507-1336-9702"},
        {"051-583-9577","0507-1345-6818","051-512-2093"},
        {"051-512-8899","051-515-9712","0507-1337-0234"},
        {"051-515-9712","051-711-4454","070-7375-7867"},
        {"051-515-9712","051-711-4454","070-7375-7867"}
    };
    string address[6][3] = {
        {"금정구 금강로 260","금정구 금강로 271-4","금정구 금강로 272-1"},
        {"금정구 장전로12번길 9","금정구 금강로 260-1","금정구 금강로 277"},
        {"금정구 금강로 248-9","금정구 부산대학로49번길 41","금정구 금정로119번길 16"},
        {"금정구 금정로68번길 35","금정구 장전로20번길 23","금정구 금샘로 34"},
        {"금정구 장전로20번길 23","금정구 부산대학로63번길 30","금정구 금정로 94"},
        {"금정구 장전로20번길 23","금정구 부산대학로63번길 30","금정구 금정로 94"}
    };
public:
    int i=0;

    void ShowRandom() {
        i = rand() % 6;
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }

    void ShowName() {
        for (int q = 0; q < 3; q++) {
            cout << left << setw(15) << name[i][q] << setw(50) << address[i][q] << setw(10) << num[i][q] << endl;
        }
    }
};

class Western
{
private:
    string food[8] = { "스테이크","파스타","피자","리조또","햄버거","필라프","브런치","부리또" };
    string restaurant[8][3] = {
        {"설어정", "잇쇼우안 스테이크", "시어링앤 스터프"},		//스테이크
        {"리틀프랑","레오","마린파스타"},						//파스타
        {"에쎄노베","17테이블","꼬모도화덕피자"},				//피자
        {"델라고","리멘시타","미태리"},						//리조또
        {"791버거트럭","버거킹","맥도날드"},					//햄버거
        {"다락마을","코코브라운","스푼"},						//필라프
        {"웬디스키친","더브런치","브런치가든숲"},				//브런치
        {"엘부리또","나우잇","테토테"}						//부리또
    };
    string Phone[8][3] = {
        {"051-583-1239","0507-1365-0019","0507-1320-6227"},
        {"051-581-0056","0507-1416-7799","051-913-2399"},
        {"070-7755-4088","0507-1394-1718","0507-1414-9995"},
        {"051-515-1504","051-513-1001","051-635-5525"},
        {"0507-1419-7910","070-7462-6769","070-7017-0406"},
        {"051-513-8003","0507-1403-0777","051-611-9486"},
        {"0507-1409-5043","051-518-9074","0507-1324-3382"},
        {"051-518-3306","0507-1346-9713","051-517-9073"},
    };
    string Address[8][3] = {
        {"부산 금정구 장전로12번길 19","부산 금정구 부산대학로50번길 40","부산 금정구 부산대학로49번길 52"},
        {"부산 금정구 부산대학로 50","부산 금정구 장전로20번길 22 1층","부산 금정구 부산대학로63번길 47"},
        {"부산 금정구 장전온천천로83번길 14","부산 금정구 금정로60번길 20","부산 금정구 금강로 254-1"},
        {"부산 금정구 금강로 253-1","부산 금정구 금강로 254","부산 금정구 부산대학로63번길 29"},
        {"부산 금정구 금정로 61-1 1층 791버거트럭","부산 금정구 금정로 66","부산 금정구 금정로60번길 24"},
        {"부산 금정구 금정로60번길 40","부산 금정구 금강로 250","부산 금정구 기찰로 69"},
        {"부산 금정구 부산대학로50번길 54 1층","부산 금정구 금강로279번길 4","부산 금정구 금정로 126 1층"},
        {"부산 금정구 금강로279번길 30-7 1층","부산 금정구 금강로 271-11 1층 102호","부산 금정구 금정로91번길 8"},
    };
public:
    int i=0;
    void ShowInfo()
    {
        i = rand() % 8;
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }
    void ShowName() {
        for (int j = 0; j < 3; j++)
            cout << left<< setw(15)<<restaurant[i][j] << setw(50) << Address[i][j] << setw(10) << Phone[i][j] << endl;
  
    }
};

class Etc
{
private:
    string food[8] = { "쌀국수", "샤브샤브", "카레", "족발", "샐러드", "샌드위치", "토스트", "맥주" };
    string restaurant[8][3] = {
        {"포맨티코","웰컴포","월면가"},						//쌀국수
        {"샤브앤나베","샤브향","채선당"},						//샤브샤브
        {"인디키친","뭄마이","카레야"},						//카레
        {"더만족","마왕족발","수림로족발"},					//족발
        {"나우잇","도르샐러드","레오앤아그너스"},				//샐러드
        {"4242샌드위치","테토테","옐로우그램"},				//샌드위치
        {"이삭토스트","테그42","에그드랍"},					//토스트
        {"벤스하버","일층집","테라스원"},						//맥주
    };
    string Phone[8][3] = {
        {"0507-1314-2682","051-512-5773","051-991-1717"},
        {"0507-1328-4550","051-515-3006","051-582-4460"},
        {"070-7340-0555","051-991-1417","070-4197-7771"},
        {"0507-1396-6866","051-517-8966","051-518-7501"},
        {"0507-1346-9713","0507-1411-6328","070-7728-3201"},
        {"0507-1318-4243","051-517-9073","010-6493-1990"},
        {"070-8771-0033","0507-1340-8922","070-4793-7778"},
        {"051-518-3771","0507-1302-4578","051-517-5151"},
    };
    string Address[8][3] = {
        {"부산 금정구 장전로12번길 16","부산 금정구 금정로 59-1","부산 금정구 장전로 16-1 1층"},
        {"부산 금정구 수림로61번길 34-1","부산 금정구 장전온천천로 51","부산 금정구 중앙대로1685번길 7"},
        {"부산 금정구 장전로12번길 50","부산 금정구 금강로 271-6","부산 금정구 금강로 275"},
        {"부산 금정구 금강로279번길 3","부산 금정구 부산대학로50번길 19","부산 금정구 수림로75번길 1"},
        {"부산 금정구 금강로 271-11 1층","부산 금정구 부산대학로 30-3","부산 금정구 금강로 260-1 1층"},
        {"부산 금정구 금강로321번길 30 1층","부산 금정구 금정로91번길 8","부산 금정구 금강로335번길 21 1층"},
        {"부산 금정구 부산대학로 63","부산 금정구 금정로 59-1 1층","부산 금정구 금정로 76"},
        {"부산 금정구 장전로12번길 24","부산 금정구 장전온천천로 97","부산 금정구 장전온천천로 51"},
    };
public:
    int i=0;

    void ShowInfo()
    {
        i = rand() % 8;
        cout << "선택된 메뉴는" << " " + food[i] + " " << "입니다." << endl;
    }
    void ShowName() {
        for (int j = 0; j < 3; j++)
            cout << left << setw(15) << restaurant[i][j] << setw(50) << Address[i][j] << setw(10) << Phone[i][j] << endl;
    }
};

int main()
{
	int k;
	srand((unsigned int)time(NULL)); //시드값 설정해주기.
	
	cout << "메뉴선택프로그램" << endl;
	cout << "1.중식 2.일식 3.치킨 4.한식 5.고기 6.디저트 7.양식 8.이 외" << endl;
	cin >> k;
    cout << "----------------------------------------------------------" << endl;
    while (k > 8) {
        cout << "다시 입력해주세요" << endl;
        cin >> k;
    }
    
	switch (k) {
	case 1:
	{
		int t;
        int r;
		cout << "중식이 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
		chinese chin;      
        chin.ShowRandom();
        cout << "----------------------------------------------------------" << endl;

        do{
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                chin.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r==1);
   
 
		cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
		cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;
		if (t == 1)
			chin.ShowAddNum();
		else
			break;
        cout << "-----------------------------------------------------------------------------" << endl;
		break;
	}

	case 2:
	{
        int t;
        int r;
		cout << "일식이 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
		japanese jap;
        jap.ShowRandom();
        cout << "----------------------------------------------------------" << endl;
    
        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                jap.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);


        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;
        if (t == 1)
            jap.ShowAddNum();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
	}

    case 3:
    {
        int t;
        int r;
        cout << "치킨이 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        chicken chic;
        chic.ShowRandom();
        cout << "----------------------------------------------------------" << endl;

        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                chic.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);

        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;

        if (t == 1) 
            chic.ShowName();    
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }

    case 4:
    {
        int t;
        int r;
        cout << "한식 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        korean k;
        k.ShowRandom();
        cout << "----------------------------------------------------------" << endl;

        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                k.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);

        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;

        if (t == 1)
           k.ShowName();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }

    case 5:
    {
        int t;
        int r;
        cout << "고기가 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        meat m;
        m.ShowRandom();
        cout << "----------------------------------------------------------" << endl;

        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                m.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);

        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;

        if (t == 1)
            m.ShowName();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }

    case 6:
    {
        int t;
        int r;
        cout << "디저트가 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        desert des;
        des.ShowRandom();
        cout << "----------------------------------------------------------" << endl;

        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                des.ShowRandom();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);

        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;
        if (t == 1)
            des.ShowName();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }

    case 7:
    {
        int t;
        int r;
        cout << "양식이 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        Western west;
        west.ShowInfo();
        cout << "----------------------------------------------------------" << endl;

        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                west.ShowInfo();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);
        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;

        if (t == 1)
            west.ShowName();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }

    case 8:
    {
        int r;
        int t;
        cout << "이 외것이 선택됐습니다." << endl;
        cout << "----------------------------------------------------------" << endl;
        Etc e;
        e.ShowInfo();
        cout << "----------------------------------------------------------" << endl;
        
        do {
            cout << "메뉴를 다시 받겠습니까 ?" << endl;
            cout << "1.Yes\t 2.NO" << endl;
            cin >> r;
            cout << "----------------------------------------------------------" << endl;
            if (r == 1) {
                e.ShowInfo();
                cout << "----------------------------------------------------------" << endl;
            }
            else
                break;
        } while (r == 1);


        cout << "근처 식당을 보겠습니까 ? 1.봄 2.안봄" << endl;
        cin >> t;
        cout << "-----------------------------------------------------------------------------" << endl;

        if (t == 1)
            e.ShowName();
        else
            break;
        cout << "-----------------------------------------------------------------------------" << endl;
        break;
    }
}
	return 0;
}